#include <iostream>
using namespace std;
int main()
{
    setlocale(0, "");
    cout << "Выберите номер месяца от 1 до 12: " ;
    int a;
    cin >> a;
    switch(a){
    case 1:
    int x1;
    cout<< "Выберите число месяца: "; 
    cin >> x1;
    if (x1>0 && x1<32){
        switch(x1){
            case 1:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 2:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
        
            case 3:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
        
            case 4:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
         
            case 5:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 6:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 7:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 8:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 9:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 10:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 11:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 12:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 13:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 14:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 15:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 16:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 17:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 18:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 19:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 20:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 21:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 22:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 23:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 24:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 25:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
           case 26:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 27:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 28:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 29:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            case 30:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
           
            case 31:
            cout << "дата установленна: "<< x1 <<" Января";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }else{
        cout << "такой даты нет";
    }
    break;
    
    case 2:
    int x2;
    cout<< "Выберите число месяца: "; 
    cin >> x2;
    if (x2>0 && x2<29){
        switch(x2){
            case 1:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 2:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
        
            case 3:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
        
            case 4:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
         
            case 5:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 6:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 7:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 8:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 9:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 10:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 11:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 12:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 13:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 14:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 15:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 16:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 17:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 18:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 19:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 20:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 21:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 22:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 23:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 24:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 25:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
           case 26:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            case 27:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
           
            case 28:
            cout << "дата установленна: "<< x2 <<" Февраля";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    } 
    else {
        cout << "такого дня нет";
    }
    break;
    
    case 3:
    int x3;
    cout<< "Выберите число месяца: "; 
    cin >> x3;
    if (x3>0 && x3<32){
        switch(x3){
            case 1:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 2:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
        
            case 3:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
        
            case 4:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
         
            case 5:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 6:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 7:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 8:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 9:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 10:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 11:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 12:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 13:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 14:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 15:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 16:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 17:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 18:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 19:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 20:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 21:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 22:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 23:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 24:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 25:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
           case 26:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 27:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 28:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 29:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            case 30:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
           
            case 31:
            cout << "дата установленна: "<< x3 <<" Марта";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 4:
    int x4;
    cout<< "Выберите число месяца: "; 
    cin >> x4;
    if (x4>0 && x4<31){
        switch(x4){
            case 1:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 2:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
        
            case 3:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
        
            case 4:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
         
            case 5:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 6:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 7:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 8:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 9:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 10:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 11:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 12:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 13:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 14:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 15:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 16:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 17:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 18:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 19:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 20:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 21:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 22:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 23:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 24:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 25:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
           case 26:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 27:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
           
            case 28:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 29:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            case 30:
            cout << "дата установленна: "<< x4 <<" Апреля";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 5:
    int x5;
    cout<< "Выберите число месяца: "; 
    cin >> x5;
    if (x5>0 && x5<32){
        switch(x5){
            case 1:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 2:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
        
            case 3:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
        
            case 4:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
         
            case 5:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 6:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 7:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 8:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 9:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 10:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 11:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 12:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 13:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 14:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 15:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 16:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 17:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 18:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 19:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 20:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 21:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 22:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 23:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 24:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 25:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
           case 26:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 27:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 28:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 29:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            case 30:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
           
            case 31:
            cout << "дата установленна: "<< x5 <<" Мая";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 6:
    int x6;
    cout<< "Выберите число месяца: "; 
    cin >> x6;
    if (x6>0 && x6<31){
        switch(x6){
            case 1:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 2:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
        
            case 3:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
        
            case 4:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
         
            case 5:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 6:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 7:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 8:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 9:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 10:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 11:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 12:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 13:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 14:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 15:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 16:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 17:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 18:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 19:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 20:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 21:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 22:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 23:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 24:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 25:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
           case 26:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 27:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
           
            case 28:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 29:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            case 30:
            cout << "дата установленна: "<< x6 <<" Июня";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 7:
    int x7;
    cout<< "Выберите число месяца: "; 
    cin >> x7;
    if (x7>0 && x7<32){
        switch(x7){
            case 1:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 2:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
        
            case 3:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
        
            case 4:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
         
            case 5:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 6:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 7:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 8:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 9:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 10:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 11:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 12:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 13:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 14:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 15:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 16:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 17:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 18:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 19:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 20:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 21:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 22:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 23:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 24:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 25:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
           case 26:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 27:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
           
            case 28:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 29:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 30:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            case 31:
            cout << "дата установленна: "<< x7 <<" Июля";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 8:
    int x8;
    cout<< "Выберите число месяца: "; 
    cin >> x8;
    if (x8>0 && x8<32){
        switch(x8){
            case 1:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 2:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
        
            case 3:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
        
            case 4:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
         
            case 5:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 6:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 7:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 8:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 9:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 10:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 11:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 12:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 13:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 14:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 15:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 16:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 17:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 18:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 19:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 20:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 21:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 22:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 23:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 24:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 25:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
           case 26:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 27:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 28:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 29:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            case 30:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
           
            case 31:
            cout << "дата установленна: "<< x8 <<" Августа";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 9:
    int x9;
    cout<< "Выберите число месяца: "; 
    cin >> x9;
    if (x9>0 && x9<31){
        switch(x9){
            case 1:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 2:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
        
            case 3:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
        
            case 4:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
         
            case 5:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 6:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 7:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 8:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 9:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 10:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 11:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 12:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 13:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 14:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 15:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 16:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 17:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 18:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 19:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 20:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 21:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 22:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 23:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 24:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 25:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
           case 26:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 27:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            case 28:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 29:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
            
            case 30:
            cout << "дата установленна: "<< x9 <<" Сентября";
            break;
           
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 10:
    int x10;
    cout<< "Выберите число месяца: "; 
    cin >> x10;
    if (x10>0 && x10<32){
        switch(x10){
            case 1:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 2:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
        
            case 3:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
        
            case 4:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
         
            case 5:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 6:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 7:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 8:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 9:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 10:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 11:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 12:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 13:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 14:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 15:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 16:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 17:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 18:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 19:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 20:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 21:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 22:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 23:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 24:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 25:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
           case 26:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 27:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
           
            case 28:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 29:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 30:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            case 31:
            cout << "дата установленна: "<< x10 <<" Октября";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    case 11:
    int x11;
    cout<< "Выберите число месяца: "; 
    cin >> x11;
    if (x11>0 && x11<31){
        switch(x11){
            case 1:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 2:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
        
            case 3:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
        
            case 4:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
         
            case 5:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 6:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 7:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 8:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 9:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 10:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 11:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 12:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 13:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 14:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 15:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 16:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 17:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 18:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 19:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 20:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 21:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 22:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 23:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 24:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 25:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
           case 26:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 27:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
           
            case 28:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 29:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            case 30:
            cout << "дата установленна: "<< x11 <<" Ноября";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    case 12:
    int x12;
    cout<< "Выберите число месяца: "; 
    cin >> x12;
    if (x12>0 && x12<32){
        switch(x12){
            case 1:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 2:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
        
            case 3:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
        
            case 4:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
         
            case 5:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 6:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 7:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 8:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 9:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 10:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 11:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 12:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 13:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 14:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 15:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 16:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 17:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 18:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 19:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 20:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 21:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 22:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 23:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 24:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 25:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
           case 26:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 27:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 28:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 29:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            case 30:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
           
            case 31:
            cout << "дата установленна: "<< x12 <<" Декабря";
            break;
            
            default:
            cout << "такой даты нет";
            break;
        }
    }
    else{
        cout << "такого дня нет";
    }
    break;
    
    default:
    cout<<"нет такого месяца"<<endl<<"попробуйте еще раз...";
    break;
    }
}